XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/pds_reg.h
/* 0xA08 : touch data process */
#define PDS_TOUCH3_OFFSET              (0xA08)
#define PDS_TOUCH_CHANNEL_CAL_EN       PDS_TOUCH_CHANNEL_CAL_EN
#define PDS_TOUCH_CHANNEL_CAL_EN_POS   (0U)
#define PDS_TOUCH_CHANNEL_CAL_EN_LEN   (1U)
#define PDS_TOUCH_CHANNEL_CAL_EN_MSK   (((1U << PDS_TOUCH_CHANNEL_CAL_EN_LEN) - 1) << PDS_TOUCH_CHANNEL_CAL_EN_POS)
#define PDS_TOUCH_CHANNEL_CAL_EN_UMSK  (~(((1U << PDS_TOUCH_CHANNEL_CAL_EN_LEN) - 1) << PDS_TOUCH_CHANNEL_CAL_EN_POS))
#define PDS_TOUCH_FORCE_VALUE_EN       PDS_TOUCH_FORCE_VALUE_EN
#define PDS_TOUCH_FORCE_VALUE_EN_POS   (1U)
#define PDS_TOUCH_FORCE_VALUE_EN_LEN   (1U)
#define PDS_TOUCH_FORCE_VALUE_EN_MSK   (((1U << PDS_TOUCH_FORCE_VALUE_EN_LEN) - 1) << PDS_TOUCH_FORCE_VALUE_EN_POS)
#define PDS_TOUCH_FORCE_VALUE_EN_UMSK  (~(((1U << PDS_TOUCH_FORCE_VALUE_EN_LEN) - 1) << PDS_TOUCH_FORCE_VALUE_EN_POS))
#define PDS_TOUCH_DATA_HYS_EN          PDS_TOUCH_DATA_HYS_EN
#define PDS_TOUCH_DATA_HYS_EN_POS      (2U)
#define PDS_TOUCH_DATA_HYS_EN_LEN      (1U)
#define PDS_TOUCH_DATA_HYS_EN_MSK      (((1U << PDS_TOUCH_DATA_HYS_EN_LEN) - 1) << PDS_TOUCH_DATA_HYS_EN_POS)
#define PDS_TOUCH_DATA_HYS_EN_UMSK     (~(((1U << PDS_TOUCH_DATA_HYS_EN_LEN) - 1) << PDS_TOUCH_DATA_HYS_EN_POS))
#define PDS_TOUCH_LTA_EN               PDS_TOUCH_LTA_EN
#define PDS_TOUCH_LTA_EN_POS           (4U)
#define PDS_TOUCH_LTA_EN_LEN           (1U)
#define PDS_TOUCH_LTA_EN_MSK           (((1U << PDS_TOUCH_LTA_EN_LEN) - 1) << PDS_TOUCH_LTA_EN_POS)
#define PDS_TOUCH_LTA_EN_UMSK          (~(((1U << PDS_TOUCH_LTA_EN_LEN) - 1) << PDS_TOUCH_LTA_EN_POS))
#define PDS_TOUCH_LTA_ORDER            PDS_TOUCH_LTA_ORDER
#define PDS_TOUCH_LTA_ORDER_POS        (5U)
#define PDS_TOUCH_LTA_ORDER_LEN        (3U)
#define PDS_TOUCH_LTA_ORDER_MSK        (((1U << PDS_TOUCH_LTA_ORDER_LEN) - 1) << PDS_TOUCH_LTA_ORDER_POS)
#define PDS_TOUCH_LTA_ORDER_UMSK       (~(((1U << PDS_TOUCH_LTA_ORDER_LEN) - 1) << PDS_TOUCH_LTA_ORDER_POS))
#define PDS_TOUCH_FLT_EN               PDS_TOUCH_FLT_EN
#define PDS_TOUCH_FLT_EN_POS           (8U)
#define PDS_TOUCH_FLT_EN_LEN           (1U)
#define PDS_TOUCH_FLT_EN_MSK           (((1U << PDS_TOUCH_FLT_EN_LEN) - 1) << PDS_TOUCH_FLT_EN_POS)
#define PDS_TOUCH_FLT_EN_UMSK          (~(((1U << PDS_TOUCH_FLT_EN_LEN) - 1) << PDS_TOUCH_FLT_EN_POS))
#define PDS_TOUCH_FLT_ORDER            PDS_TOUCH_FLT_ORDER
#define PDS_TOUCH_FLT_ORDER_POS        (9U)
#define PDS_TOUCH_FLT_ORDER_LEN        (3U)
#define PDS_TOUCH_FLT_ORDER_MSK        (((1U << PDS_TOUCH_FLT_ORDER_LEN) - 1) << PDS_TOUCH_FLT_ORDER_POS)
#define PDS_TOUCH_FLT_ORDER_UMSK       (~(((1U << PDS_TOUCH_FLT_ORDER_LEN) - 1) << PDS_TOUCH_FLT_ORDER_POS))
#define PDS_TOUCH_SELF_MUTUAL_SEL      PDS_TOUCH_SELF_MUTUAL_SEL
#define PDS_TOUCH_SELF_MUTUAL_SEL_POS  (12U)
#define PDS_TOUCH_SELF_MUTUAL_SEL_LEN  (1U)
#define PDS_TOUCH_SELF_MUTUAL_SEL_MSK  (((1U << PDS_TOUCH_SELF_MUTUAL_SEL_LEN) - 1) << PDS_TOUCH_SELF_MUTUAL_SEL_POS)
#define PDS_TOUCH_SELF_MUTUAL_SEL_UMSK (~(((1U << PDS_TOUCH_SELF_MUTUAL_SEL_LEN) - 1) << PDS_TOUCH_SELF_MUTUAL_SEL_POS))
#define PDS_TOUCH_VLDO_CCSEL           PDS_TOUCH_VLDO_CCSEL
#define PDS_TOUCH_VLDO_CCSEL_POS       (13U)
#define PDS_TOUCH_VLDO_CCSEL_LEN       (2U)
#define PDS_TOUCH_VLDO_CCSEL_MSK       (((1U << PDS_TOUCH_VLDO_CCSEL_LEN) - 1) << PDS_TOUCH_VLDO_CCSEL_POS)
#define PDS_TOUCH_VLDO_CCSEL_UMSK      (~(((1U << PDS_TOUCH_VLDO_CCSEL_LEN) - 1) << PDS_TOUCH_VLDO_CCSEL_POS))
#define PDS_TEN_TOUCH                  PDS_TEN_TOUCH
#define PDS_TEN_TOUCH_POS              (18U)
#define PDS_TEN_TOUCH_LEN              (1U)
#define PDS_TEN_TOUCH_MSK              (((1U << PDS_TEN_TOUCH_LEN) - 1) << PDS_TEN_TOUCH_POS)
#define PDS_TEN_TOUCH_UMSK             (~(((1U << PDS_TEN_TOUCH_LEN) - 1) << PDS_TEN_TOUCH_POS))

/* 0xA0C : Touch_sleep_time */
#define PDS_TOUCH_SLEEP_TIME_OFFSET (0xA0C)
#define PDS_TOUCH_SLEEP_CYCLE       PDS_TOUCH_SLEEP_CYCLE
#define PDS_TOUCH_SLEEP_CYCLE_POS   (0U)
#define PDS_TOUCH_SLEEP_CYCLE_LEN   (23U)
#define PDS_TOUCH_SLEEP_CYCLE_MSK   (((1U << PDS_TOUCH_SLEEP_CYCLE_LEN) - 1) << PDS_TOUCH_SLEEP_CYCLE_POS)
#define PDS_TOUCH_SLEEP_CYCLE_UMSK  (~(((1U << PDS_TOUCH_SLEEP_CYCLE_LEN) - 1) << PDS_TOUCH_SLEEP_CYCLE_POS))

/* 0xA10 : touch_data_hystersis */
#define PDS_TOUCH_DATA_HYSTERSIS_OFFSET (0xA10)
#define PDS_TOUCH_DATA_HYS              PDS_TOUCH_DATA_HYS
#define PDS_TOUCH_DATA_HYS_POS          (0U)
#define PDS_TOUCH_DATA_HYS_LEN          (9U)
#define PDS_TOUCH_DATA_HYS_MSK          (((1U << PDS_TOUCH_DATA_HYS_LEN) - 1) << PDS_TOUCH_DATA_HYS_POS)
#define PDS_TOUCH_DATA_HYS_UMSK         (~(((1U << PDS_TOUCH_DATA_HYS_LEN) - 1) << PDS_TOUCH_DATA_HYS_POS))

/* 0xA14 : Channel_force_data_0 */
#define PDS_CHANNEL_FORCE_DATA_0_OFFSET (0xA14)
#define PDS_TOUCH_FORCE_DATA_CH0        PDS_TOUCH_FORCE_DATA_CH0
#define PDS_TOUCH_FORCE_DATA_CH0_POS    (0U)
#define PDS_TOUCH_FORCE_DATA_CH0_LEN    (16U)
#define PDS_TOUCH_FORCE_DATA_CH0_MSK    (((1U << PDS_TOUCH_FORCE_DATA_CH0_LEN) - 1) << PDS_TOUCH_FORCE_DATA_CH0_POS)
#define PDS_TOUCH_FORCE_DATA_CH0_UMSK   (~(((1U << PDS_TOUCH_FORCE_DATA_CH0_LEN) - 1) << PDS_TOUCH_FORCE_DATA_CH0_POS))
#define PDS_TOUCH_FORCE_DATA_CH1        PDS_TOUCH_FORCE_DATA_CH1
#define PDS_TOUCH_FORCE_DATA_CH1_POS    (16U)
#define PDS_TOUCH_FORCE_DATA_CH1_LEN    (16U)
#define PDS_TOUCH_FORCE_DATA_CH1_MSK    (((1U << PDS_TOUCH_FORCE_DATA_CH1_LEN) - 1) << PDS_TOUCH_FORCE_DATA_CH1_POS)
#define PDS_TOUCH_FORCE_DATA_CH1_UMSK   (~(((1U << PDS_TOUCH_FORCE_DATA_CH1_LEN) - 1) << PDS_TOUCH_FORCE_DATA_CH1_POS))

/* 0xA18 : Channel_force_data_1 */
#define PDS_CHANNEL_FORCE_DATA_1_OFFSET (0xA18)
#define PDS_TOUCH_FORCE_DATA_CH2        PDS_TOUCH_FORCE_DATA_CH2
#define PDS_TOUCH_FORCE_DATA_CH2_POS    (0U)
#define PDS_TOUCH_FORCE_DATA_CH2_LEN    (16U)
#define PDS_TOUCH_FORCE_DATA_CH2_MSK    (((1U << PDS_TOUCH_FORCE_DATA_CH2_LEN) - 1) << PDS_TOUCH_FORCE_DATA_CH2_POS)
#define PDS_TOUCH_FORCE_DATA_CH2_UMSK   (~(((1U << PDS_TOUCH_FORCE_DATA_CH2_LEN) - 1) << PDS_TOUCH_FORCE_DATA_CH2_POS))
#define PDS_TOUCH_FORCE_DATA_CH3        PDS_TOUCH_FORCE_DATA_CH3
#define PDS_TOUCH_FORCE_DATA_CH3_POS    (16U)
#define PDS_TOUCH_FORCE_DATA_CH3_LEN    (16U)
#define PDS_TOUCH_FORCE_DATA_CH3_MSK    (((1U << PDS_TOUCH_FORCE_DATA_CH3_LEN) - 1) << PDS_TOUCH_FORCE_DATA_CH3_POS)
#define PDS_TOUCH_FORCE_DATA_CH3_UMSK   (~(((1U << PDS_TOUCH_FORCE_DATA_CH3_LEN) - 1) << PDS_TOUCH_FORCE_DATA_CH3_POS))

/* 0xA1C : Channel_force_data_2 */
#define PDS_CHANNEL_FORCE_DATA_2_OFFSET (0xA1C)
#define PDS_TOUCH_FORCE_DATA_CH4        PDS_TOUCH_FORCE_DATA_CH4
#define PDS_TOUCH_FORCE_DATA_CH4_POS    (0U)
#define PDS_TOUCH_FORCE_DATA_CH4_LEN    (16U)
#define PDS_TOUCH_FORCE_DATA_CH4_MSK    (((1U << PDS_TOUCH_FORCE_DATA_CH4_LEN) - 1) << PDS_TOUCH_FORCE_DATA_CH4_POS)
#define PDS_TOUCH_FORCE_DATA_CH4_UMSK   (~(((1U << PDS_TOUCH_FORCE_DATA_CH4_LEN) - 1) << PDS_TOUCH_FORCE_DATA_CH4_POS))
#define PDS_TOUCH_FORCE_DATA_CH5        PDS_TOUCH_FORCE_DATA_CH5
#define PDS_TOUCH_FORCE_DATA_CH5_POS    (16U)
#define PDS_TOUCH_FORCE_DATA_CH5_LEN    (16U)
#define PDS_TOUCH_FORCE_DATA_CH5_MSK    (((1U << PDS_TOUCH_FORCE_DATA_CH5_LEN) - 1) << PDS_TOUCH_FORCE_DATA_CH5_POS)
#define PDS_TOUCH_FORCE_DATA_CH5_UMSK   (~(((1U << PDS_TOUCH_FORCE_DATA_CH5_LEN) - 1) << PDS_TOUCH_FORCE_DATA_CH5_POS))

/* 0xA20 : Channel_force_data_3 */
#define PDS_CHANNEL_FORCE_DATA_3_OFFSET (0xA20)
#define PDS_TOUCH_FORCE_DATA_CH6        PDS_TOUCH_FORCE_DATA_CH6
#define PDS_TOUCH_FORCE_DATA_CH6_POS    (0U)
#define PDS_TOUCH_FORCE_DATA_CH6_LEN    (16U)
#define PDS_TOUCH_FORCE_DATA_CH6_MSK    (((1U << PDS_TOUCH_FORCE_DATA_CH6_LEN) - 1) << PDS_TOUCH_FORCE_DATA_CH6_POS)
#define PDS_TOUCH_FORCE_DATA_CH6_UMSK   (~(((1U << PDS_TOUCH_FORCE_DATA_CH6_LEN) - 1) << PDS_TOUCH_FORCE_DATA_CH6_POS))
#define PDS_TOUCH_FORCE_DATA_CH7        PDS_TOUCH_FORCE_DATA_CH7
#define PDS_TOUCH_FORCE_DATA_CH7_POS    (16U)
#define PDS_TOUCH_FORCE_DATA_CH7_LEN    (16U)
#define PDS_TOUCH_FORCE_DATA_CH7_MSK    (((1U << PDS_TOUCH_FORCE_DATA_CH7_LEN) - 1) << PDS_TOUCH_FORCE_DATA_CH7_POS)
#define PDS_TOUCH_FORCE_DATA_CH7_UMSK   (~(((1U << PDS_TOUCH_FORCE_DATA_CH7_LEN) - 1) << PDS_TOUCH_FORCE_DATA_CH7_POS))

/* 0xA24 : Channel_force_data_4 */
#define PDS_CHANNEL_FORCE_DATA_4_OFFSET (0xA24)
#define PDS_TOUCH_FORCE_DATA_CH8        PDS_TOUCH_FORCE_DATA_CH8
#define PDS_TOUCH_FORCE_DATA_CH8_POS    (0U)
#define PDS_TOUCH_FORCE_DATA_CH8_LEN    (16U)
#define PDS_TOUCH_FORCE_DATA_CH8_MSK    (((1U << PDS_TOUCH_FORCE_DATA_CH8_LEN) - 1) << PDS_TOUCH_FORCE_DATA_CH8_POS)
#define PDS_TOUCH_FORCE_DATA_CH8_UMSK   (~(((1U << PDS_TOUCH_FORCE_DATA_CH8_LEN) - 1) << PDS_TOUCH_FORCE_DATA_CH8_POS))
#define PDS_TOUCH_FORCE_DATA_CH9        PDS_TOUCH_FORCE_DATA_CH9
#define PDS_TOUCH_FORCE_DATA_CH9_POS    (16U)
#define PDS_TOUCH_FORCE_DATA_CH9_LEN    (16U)
#define PDS_TOUCH_FORCE_DATA_CH9_MSK    (((1U << PDS_TOUCH_FORCE_DATA_CH9_LEN) - 1) << PDS_TOUCH_FORCE_DATA_CH9_POS)
#define PDS_TOUCH_FORCE_DATA_CH9_UMSK   (~(((1U << PDS_TOUCH_FORCE_DATA_CH9_LEN) - 1) << PDS_TOUCH_FORCE_DATA_CH9_POS))

/* 0xA28 : Channel_force_data_5 */
#define PDS_CHANNEL_FORCE_DATA_5_OFFSET (0xA28)
#define PDS_TOUCH_FORCE_DATA_CH10       PDS_TOUCH_FORCE_DATA_CH10
#define PDS_TOUCH_FORCE_DATA_CH10_POS   (0U)
#define PDS_TOUCH_FORCE_DATA_CH10_LEN   (16U)
#define PDS_TOUCH_FORCE_DATA_CH10_MSK   (((1U << PDS_TOUCH_FORCE_DATA_CH10_LEN) - 1) << PDS_TOUCH_FORCE_DATA_CH10_POS)
#define PDS_TOUCH_FORCE_DATA_CH10_UMSK  (~(((1U << PDS_TOUCH_FORCE_DATA_CH10_LEN) - 1) << PDS_TOUCH_FORCE_DATA_CH10_POS))
#define PDS_TOUCH_FORCE_DATA_CH11       PDS_TOUCH_FORCE_DATA_CH11
#define PDS_TOUCH_FORCE_DATA_CH11_POS   (16U)
#define PDS_TOUCH_FORCE_DATA_CH11_LEN   (16U)
#define PDS_TOUCH_FORCE_DATA_CH11_MSK   (((1U << PDS_TOUCH_FORCE_DATA_CH11_LEN) - 1) << PDS_TOUCH_FORCE_DATA_CH11_POS)
#define PDS_TOUCH_FORCE_DATA_CH11_UMSK  (~(((1U << PDS_TOUCH_FORCE_DATA_CH11_LEN) - 1) << PDS_TOUCH_FORCE_DATA_CH11_POS))

/* 0xA2C : Channel_vth_data_0 */
#define PDS_CHANNEL_VTH_DATA_0_OFFSET (0xA2C)
#define PDS_TOUCH_VTH_DATA_CH0        PDS_TOUCH_VTH_DATA_CH0
#define PDS_TOUCH_VTH_DATA_CH0_POS    (0U)
#define PDS_TOUCH_VTH_DATA_CH0_LEN    (8U)
#define PDS_TOUCH_VTH_DATA_CH0_MSK    (((1U << PDS_TOUCH_VTH_DATA_CH0_LEN) - 1) << PDS_TOUCH_VTH_DATA_CH0_POS)
#define PDS_TOUCH_VTH_DATA_CH0_UMSK   (~(((1U << PDS_TOUCH_VTH_DATA_CH0_LEN) - 1) << PDS_TOUCH_VTH_DATA_CH0_POS))
#define PDS_TOUCH_VTH_DATA_CH1        PDS_TOUCH_VTH_DATA_CH1
#define PDS_TOUCH_VTH_DATA_CH1_POS    (8U)
#define PDS_TOUCH_VTH_DATA_CH1_LEN    (8U)
#define PDS_TOUCH_VTH_DATA_CH1_MSK    (((1U << PDS_TOUCH_VTH_DATA_CH1_LEN) - 1) << PDS_TOUCH_VTH_DATA_CH1_POS)
#define PDS_TOUCH_VTH_DATA_CH1_UMSK   (~(((1U << PDS_TOUCH_VTH_DATA_CH1_LEN) - 1) << PDS_TOUCH_VTH_DATA_CH1_POS))
#define PDS_TOUCH_VTH_DATA_CH2        PDS_TOUCH_VTH_DATA_CH2
#define PDS_TOUCH_VTH_DATA_CH2_POS    (16U)
#define PDS_TOUCH_VTH_DATA_CH2_LEN    (8U)
#define PDS_TOUCH_VTH_DATA_CH2_MSK    (((1U << PDS_TOUCH_VTH_DATA_CH2_LEN) - 1) << PDS_TOUCH_VTH_DATA_CH2_POS)
#define PDS_TOUCH_VTH_DATA_CH2_UMSK   (~(((1U << PDS_TOUCH_VTH_DATA_CH2_LEN) - 1) << PDS_TOUCH_VTH_DATA_CH2_POS))
#define PDS_TOUCH_VTH_DATA_CH3        PDS_TOUCH_VTH_DATA_CH3
#define PDS_TOUCH_VTH_DATA_CH3_POS    (24U)
#define PDS_TOUCH_VTH_DATA_CH3_LEN    (8U)
#define PDS_TOUCH_VTH_DATA_CH3_MSK    (((1U << PDS_TOUCH_VTH_DATA_CH3_LEN) - 1) << PDS_TOUCH_VTH_DATA_CH3_POS)
#define PDS_TOUCH_VTH_DATA_CH3_UMSK   (~(((1U << PDS_TOUCH_VTH_DATA_CH3_LEN) - 1) << PDS_TOUCH_VTH_DATA_CH3_POS))

