XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/pds_reg.h
    /* 0x4 : PDS_TIME1 */
    union {
        struct {
            uint32_t cr_sleep_duration : 32; /* [31: 0],        r/w,      0xca8 */
        } BF;
        uint32_t WORD;
    } PDS_TIME1;

    /* 0x8  reserved */
    uint8_t RESERVED0x8[4];

    /* 0xC : PDS_INT */
    union {
        struct {
            uint32_t ro_pds_wake_int                  : 1;  /* [    0],          r,        0x0 */
            uint32_t ro_pds_rf_done_int               : 1;  /* [    1],          r,        0x0 */
            uint32_t ro_pds_wifi_tbtt_sleep_irq       : 1;  /* [    2],          r,        0x0 */
            uint32_t ro_pds_wifi_tbtt_wakeup_irq      : 1;  /* [    3],          r,        0x0 */
            uint32_t cr_pds_wake_int_mask             : 1;  /* [    4],        r/w,        0x0 */
            uint32_t cr_pds_rf_done_int_mask          : 1;  /* [    5],        r/w,        0x0 */
            uint32_t cr_pds_wifi_tbtt_sleep_irq_mask  : 1;  /* [    6],        r/w,        0x0 */
            uint32_t cr_pds_wifi_tbtt_wakeup_irq_mask : 1;  /* [    7],        r/w,        0x0 */
            uint32_t cr_pds_int_clr                   : 1;  /* [    8],        r/w,        0x0 */
            uint32_t reserved_9                       : 1;  /* [    9],       rsvd,        0x0 */
            uint32_t cr_pds_wakeup_src_en             : 11; /* [20:10],        r/w,      0x7ff */
            uint32_t ro_pds_wakeup_event              : 11; /* [31:21],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } PDS_INT;

    /* 0x10 : PDS_CTL2 */
    union {
        struct {
            uint32_t reserved_0                : 1;  /* [    0],       rsvd,        0x0 */
            uint32_t cr_pds_force_mm_pwr_off   : 1;  /* [    1],        r/w,        0x1 */
            uint32_t reserved_2                : 1;  /* [    2],       rsvd,        0x0 */
            uint32_t cr_pds_force_usb_pwr_off  : 1;  /* [    3],        r/w,        0x0 */
            uint32_t reserved_4                : 1;  /* [    4],       rsvd,        0x0 */
            uint32_t cr_pds_force_mm_iso_en    : 1;  /* [    5],        r/w,        0x1 */
            uint32_t reserved_6                : 1;  /* [    6],       rsvd,        0x0 */
            uint32_t cr_pds_force_usb_iso_en   : 1;  /* [    7],        r/w,        0x0 */
            uint32_t cr_pds_force_np_pds_rst   : 1;  /* [    8],        r/w,        0x0 */
            uint32_t cr_pds_force_mm_pds_rst   : 1;  /* [    9],        r/w,        0x1 */
            uint32_t cr_pds_force_wb_pds_rst   : 1;  /* [   10],        r/w,        0x0 */
            uint32_t cr_pds_force_usb_pds_rst  : 1;  /* [   11],        r/w,        0x0 */
            uint32_t cr_pds_force_np_mem_stby  : 1;  /* [   12],        r/w,        0x0 */
            uint32_t cr_pds_force_mm_mem_stby  : 1;  /* [   13],        r/w,        0x1 */
            uint32_t cr_pds_force_wb_mem_stby  : 1;  /* [   14],        r/w,        0x0 */
            uint32_t cr_pds_force_usb_mem_stby : 1;  /* [   15],        r/w,        0x0 */
            uint32_t cr_pds_force_np_gate_clk  : 1;  /* [   16],        r/w,        0x0 */
            uint32_t cr_pds_force_mm_gate_clk  : 1;  /* [   17],        r/w,        0x1 */
            uint32_t cr_pds_force_wb_gate_clk  : 1;  /* [   18],        r/w,        0x0 */
            uint32_t cr_pds_force_usb_gate_clk : 1;  /* [   19],        r/w,        0x0 */
            uint32_t reserved_20_31            : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } PDS_CTL2;

    /* 0x14 : PDS_CTL3 */
    union {
        struct {
            uint32_t reserved_0                 : 1;  /* [    0],       rsvd,        0x0 */
            uint32_t cr_pds_force_misc_pwr_off  : 1;  /* [    1],        r/w,        0x0 */
            uint32_t reserved_2_3               : 2;  /* [ 3: 2],       rsvd,        0x0 */
            uint32_t cr_pds_force_misc_iso_en   : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reserved_5_6               : 2;  /* [ 6: 5],       rsvd,        0x0 */
            uint32_t cr_pds_force_misc_pds_rst  : 1;  /* [    7],        r/w,        0x0 */
            uint32_t reserved_8_9               : 2;  /* [ 9: 8],       rsvd,        0x0 */
            uint32_t cr_pds_force_misc_mem_stby : 1;  /* [   10],        r/w,        0x0 */
            uint32_t reserved_11_12             : 2;  /* [12:11],       rsvd,        0x0 */
            uint32_t cr_pds_force_misc_gate_clk : 1;  /* [   13],        r/w,        0x0 */
            uint32_t reserved_14_25             : 12; /* [25:14],       rsvd,        0x0 */
            uint32_t cr_pds_mm_iso_en           : 1;  /* [   26],        r/w,        0x1 */
            uint32_t reserved_27_28             : 2;  /* [28:27],       rsvd,        0x0 */
            uint32_t cr_pds_usb_iso_en          : 1;  /* [   29],        r/w,        0x1 */
            uint32_t cr_pds_misc_iso_en         : 1;  /* [   30],        r/w,        0x1 */
            uint32_t reserved_31                : 1;  /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } PDS_CTL3;

    /* 0x18 : PDS_CTL4 */
    union {
        struct {
            uint32_t reserved_0           : 1; /* [    0],       rsvd,        0x0 */
            uint32_t cr_pds_np_reset      : 1; /* [    1],        r/w,        0x1 */
            uint32_t cr_pds_np_mem_stby   : 1; /* [    2],        r/w,        0x1 */
            uint32_t cr_pds_np_gate_clk   : 1; /* [    3],        r/w,        0x1 */
            uint32_t reserved_4_7         : 4; /* [ 7: 4],       rsvd,        0x0 */
            uint32_t cr_pds_mm_pwr_off    : 1; /* [    8],        r/w,        0x1 */
            uint32_t cr_pds_mm_reset      : 1; /* [    9],        r/w,        0x1 */
            uint32_t cr_pds_mm_mem_stby   : 1; /* [   10],        r/w,        0x1 */
            uint32_t cr_pds_mm_gate_clk   : 1; /* [   11],        r/w,        0x1 */
            uint32_t reserved_12          : 1; /* [   12],       rsvd,        0x0 */
            uint32_t cr_pds_wb_reset      : 1; /* [   13],        r/w,        0x1 */
            uint32_t cr_pds_wb_mem_stby   : 1; /* [   14],        r/w,        0x1 */
            uint32_t cr_pds_wb_gate_clk   : 1; /* [   15],        r/w,        0x1 */
            uint32_t reserved_16_19       : 4; /* [19:16],       rsvd,        0x0 */
            uint32_t cr_pds_usb_pwr_off   : 1; /* [   20],        r/w,        0x1 */
            uint32_t cr_pds_usb_reset     : 1; /* [   21],        r/w,        0x1 */
            uint32_t cr_pds_usb_mem_stby  : 1; /* [   22],        r/w,        0x1 */
            uint32_t cr_pds_usb_gate_clk  : 1; /* [   23],        r/w,        0x1 */
            uint32_t cr_pds_misc_pwr_off  : 1; /* [   24],        r/w,        0x1 */
            uint32_t cr_pds_misc_reset    : 1; /* [   25],        r/w,        0x1 */
            uint32_t cr_pds_misc_mem_stby : 1; /* [   26],        r/w,        0x1 */
            uint32_t cr_pds_misc_gate_clk : 1; /* [   27],        r/w,        0x1 */
            uint32_t reserved_28_31       : 4; /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } PDS_CTL4;

    /* 0x1C : pds_stat */
    union {
        struct {
            uint32_t ro_pds_state        : 5;  /* [ 4: 0],          r,        0x0 */
            uint32_t reserved_5_7        : 3;  /* [ 7: 5],       rsvd,        0x0 */
            uint32_t ro_pds_rf_state     : 5;  /* [12: 8],          r,        0x0 */
            uint32_t reserved_13_23      : 11; /* [23:13],       rsvd,        0x0 */
            uint32_t pds_reset_event     : 3;  /* [26:24],          r,        0x0 */
            uint32_t reserved_27_30      : 4;  /* [30:27],       rsvd,        0x0 */
            uint32_t pds_clr_reset_event : 1;  /* [   31],        w1c,        0x0 */
        } BF;
        uint32_t WORD;
    } pds_stat;

    /* 0x20 : pds_ram1 */
    union {
        struct {
            uint32_t cr_ocram_slp             : 4; /* [ 3: 0],        r/w,        0x0 */
            uint32_t cr_ocram_ret             : 4; /* [ 7: 4],        r/w,        0x0 */
            uint32_t cr_pds_ram_clk_cnt       : 6; /* [13: 8],        r/w,        0x8 */
            uint32_t reserved_14_15           : 2; /* [15:14],       rsvd,        0x0 */
            uint32_t cr_pds_ram_clk2_cnt      : 6; /* [21:16],        r/w,       0x18 */
            uint32_t reserved_22_23           : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t cr_pds_ctrl_np_ram_clk   : 1; /* [   24],        r/w,        0x0 */
            uint32_t cr_pds_ctrl_mm_ram_clk   : 1; /* [   25],        r/w,        0x0 */
            uint32_t cr_pds_ctrl_wb_ram_clk   : 1; /* [   26],        r/w,        0x0 */
            uint32_t cr_pds_ctrl_usb_ram_clk  : 1; /* [   27],        r/w,        0x0 */
            uint32_t cr_pds_ctrl_misc_ram_clk : 1; /* [   28],        r/w,        0x0 */
            uint32_t reserved_29              : 1; /* [   29],       rsvd,        0x0 */
            uint32_t cr_pds_ctrl_ram_clk2     : 1; /* [   30],        r/w,        0x0 */
            uint32_t cr_pds_ctrl_ram_clk      : 1; /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } pds_ram1;

    /* 0x24 : PDS_CTL5 */
    union {
        struct {
            uint32_t cr_np_wfi_mask      : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reserved_1          : 1;  /* [    1],       rsvd,        0x0 */
            uint32_t cr_mm_wfi_mask      : 1;  /* [    2],        r/w,        0x0 */
            uint32_t reserved_3          : 1;  /* [    3],       rsvd,        0x0 */
            uint32_t cr_pico_wfi_mask    : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reserved_5_7        : 3;  /* [ 7: 5],       rsvd,        0x0 */
            uint32_t cr_pds_ctrl_usb33   : 1;  /* [    8],        r/w,        0x0 */
            uint32_t cr_pds_pd_ldo18io   : 1;  /* [    9],        r/w,        0x0 */
            uint32_t reserved_10_15      : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t cr_pds_gpio_keep_en : 3;  /* [18:16],        r/w,        0x7 */
            uint32_t reserved_19_31      : 13; /* [31:19],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } PDS_CTL5;

    /* 0x28 : PDS_RAM2 */
    union {
        struct {
            uint32_t cr_wram_slp    : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t cr_wram_ret    : 10; /* [19:10],        r/w,        0x0 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } PDS_RAM2;

    /* 0x2c  reserved */
    uint8_t RESERVED0x2c[4];

    /* 0x30 : pds_gpio_i_set */
    union {
        struct {
            uint32_t cr_pds_gpio_ie_set : 3;  /* [ 2: 0],        r/w,        0x0 */
            uint32_t cr_pds_gpio_pd_set : 3;  /* [ 5: 3],        r/w,        0x0 */
            uint32_t cr_pds_gpio_pu_set : 3;  /* [ 8: 6],        r/w,        0x0 */
            uint32_t reserved_9_31      : 23; /* [31: 9],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pds_gpio_i_set;

