XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/pds_reg.h
    /* 0xA30 : Channel_vth_data_1 */
    union {
        struct {
            uint32_t touch_vth_data_ch4 : 8; /* [ 7: 0],        r/w,       0x1f */
            uint32_t touch_vth_data_ch5 : 8; /* [15: 8],        r/w,       0x1f */
            uint32_t touch_vth_data_ch6 : 8; /* [23:16],        r/w,       0x1f */
            uint32_t touch_vth_data_ch7 : 8; /* [31:24],        r/w,       0x3f */
        } BF;
        uint32_t WORD;
    } Channel_vth_data_1;

    /* 0xA34 : Channel_vth_data_2 */
    union {
        struct {
            uint32_t touch_vth_data_ch8  : 8; /* [ 7: 0],        r/w,       0x3f */
            uint32_t touch_vth_data_ch9  : 8; /* [15: 8],        r/w,       0x3f */
            uint32_t touch_vth_data_ch10 : 8; /* [23:16],        r/w,       0x3f */
            uint32_t touch_vth_data_ch11 : 8; /* [31:24],        r/w,       0x3f */
        } BF;
        uint32_t WORD;
    } Channel_vth_data_2;

    /* 0xA38 : Channel_raw_data_0 */
    union {
        struct {
            uint32_t touch_raw_data_ch0 : 16; /* [15: 0],          R,        0x0 */
            uint32_t reserved_16_31     : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } Channel_raw_data_0;

    /* 0xA3C : Channel_raw_data_1 */
    union {
        struct {
            uint32_t touch_raw_data_ch1 : 16; /* [15: 0],          R,        0x0 */
            uint32_t reserved_16_31     : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } Channel_raw_data_1;

    /* 0xA40 : Channel_raw_data_2 */
    union {
        struct {
            uint32_t touch_raw_data_ch2 : 16; /* [15: 0],          R,        0x0 */
            uint32_t reserved_16_31     : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } Channel_raw_data_2;

    /* 0xA44 : Channel_raw_data_3 */
    union {
        struct {
            uint32_t touch_raw_data_ch3 : 16; /* [15: 0],          R,        0x0 */
            uint32_t reserved_16_31     : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } Channel_raw_data_3;

    /* 0xA48 : Channel_raw_data_4 */
    union {
        struct {
            uint32_t touch_raw_data_ch4 : 16; /* [15: 0],          R,        0x0 */
            uint32_t reserved_16_31     : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } Channel_raw_data_4;

    /* 0xA4C : Channel_raw_data_5 */
    union {
        struct {
            uint32_t touch_raw_data_ch5 : 16; /* [15: 0],          R,        0x0 */
            uint32_t reserved_16_31     : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } Channel_raw_data_5;

    /* 0xA50 : Channel_raw_data_6 */
    union {
        struct {
            uint32_t touch_raw_data_ch6 : 16; /* [15: 0],          R,        0x0 */
            uint32_t reserved_16_31     : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } Channel_raw_data_6;

    /* 0xA54 : Channel_raw_data_7 */
    union {
        struct {
            uint32_t touch_raw_data_ch7 : 16; /* [15: 0],          R,        0x0 */
            uint32_t reserved_16_31     : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } Channel_raw_data_7;

    /* 0xA58 : Channel_raw_data_8 */
    union {
        struct {
            uint32_t touch_raw_data_ch8 : 16; /* [15: 0],          R,        0x0 */
            uint32_t reserved_16_31     : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } Channel_raw_data_8;

    /* 0xA5C : Channel_raw_data_9 */
    union {
        struct {
            uint32_t touch_raw_data_ch9 : 16; /* [15: 0],          R,        0x0 */
            uint32_t reserved_16_31     : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } Channel_raw_data_9;

    /* 0xA60 : Channel_raw_data_10 */
    union {
        struct {
            uint32_t touch_raw_data_ch10 : 16; /* [15: 0],          R,        0x0 */
            uint32_t reserved_16_31      : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } Channel_raw_data_10;

    /* 0xA64 : Channel_raw_data_11 */
    union {
        struct {
            uint32_t touch_raw_data_ch11 : 16; /* [15: 0],          R,        0x0 */
            uint32_t reserved_16_31      : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } Channel_raw_data_11;

    /* 0xA68 : Channel_LTA_data_0 */
    union {
        struct {
            uint32_t touch_lta_data_ch0 : 16; /* [15: 0],          R,        0x0 */
            uint32_t reserved_16_31     : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } Channel_LTA_data_0;

    /* 0xA6C : Channel_LTA_data_1 */
    union {
        struct {
            uint32_t touch_lta_data_ch1 : 16; /* [15: 0],          R,        0x0 */
            uint32_t reserved_16_31     : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } Channel_LTA_data_1;

    /* 0xA70 : Channel_LTA_data_2 */
    union {
        struct {
            uint32_t touch_lta_data_ch2 : 16; /* [15: 0],          R,        0x0 */
            uint32_t reserved_16_31     : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } Channel_LTA_data_2;

    /* 0xA74 : Channel_LTA_data_3 */
    union {
        struct {
            uint32_t touch_lta_data_ch3 : 16; /* [15: 0],          R,        0x0 */
            uint32_t reserved_16_31     : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } Channel_LTA_data_3;

    /* 0xA78 : Channel_LTA_data_4 */
    union {
        struct {
            uint32_t touch_lta_data_ch4 : 16; /* [15: 0],          R,        0x0 */
            uint32_t reserved_16_31     : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } Channel_LTA_data_4;

    /* 0xA7C : Channel_LTA_data_5 */
    union {
        struct {
            uint32_t touch_lta_data_ch5 : 16; /* [15: 0],          R,        0x0 */
            uint32_t reserved_16_31     : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } Channel_LTA_data_5;

    /* 0xA80 : Channel_LTA_data_6 */
    union {
        struct {
            uint32_t touch_lta_data_ch6 : 16; /* [15: 0],          R,        0x0 */
            uint32_t reserved_16_31     : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } Channel_LTA_data_6;

